#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=19c739a6-6481-4573-a63b-2c8ac87de66d]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8bac8b3b-9af1-41ac-92df-d793d505829b]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4682d497-a568-4107-b4f9-c3f93f5c5141]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6281c3ce-c018-425b-a7a5-ba5fbb8299ac]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=615e06ce-df60-4c54-ad33-da7890c93311]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=4f9de1d7-3d95-4406-bd21-d7e2f64d5aa9]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d5ab0201-d0a3-4800-bcab-13dcc6970e02]
module.keycloak_test.module.onestopauth.module.client_dss-kirk-1288.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=dc8980c3-0aae-41e3-af1e-247157c75278]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0c10894d-a21c-49a8-80e0-8445df96203c]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=af4683ec-e4c7-40e0-adea-606dbeb15c16]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=18423dcd-ceb9-4e37-bd53-a3410a70069a]
module.keycloak_test.module.onestopauth.module.client_wildlife-health-information-system-1618.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=05fd3352-1048-4159-afdb-022a587745f4]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=47ef161f-5377-4598-b7a4-eb4546ff4dd6]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f4d7181-3389-4b7d-86d7-3576d387db6b]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8e440647-f091-4432-9b41-b150268248af]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=26395855-cdc0-4ad4-bee4-8a6eb47dc215]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=76de9706-0c1a-49d0-b2ae-4aa6a717de70]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=19450e83-87f2-439e-bbc6-b7d4a3218c7b]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=84eeb000-5810-41ac-a752-687fa0ae38e4]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c6eaa078-6965-4f29-85c4-28a4e7f9ae27]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1948.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cd7e725b-940c-433c-b0cf-5e4456e5c63c]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=eab68a5f-0f4e-4654-bcb6-7220ffdd74ee]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=e6e98bf3-929b-450b-a98f-82cd47b03fba]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7009c9cc-54d1-45b9-bc67-a3d25cf42dd5]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4910fec8-501c-43f8-87cf-710e283e0490]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=8d8b346b-2428-416c-8a93-46d81fe1624a]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=32452579-a9fb-4a16-ad99-b2fe02196651]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=29c4eb8c-6ac2-425c-8c9d-fd8b16e5f4ba]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=934f5472-219a-417d-8ec5-8aa7bf64c206]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=bd15d9e2-50ab-412f-abb1-232c69ad5448]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=80405ebd-d65b-468e-9d1a-a34ac95b141f]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=2889748c-4592-4bf8-aba0-fce5f28e7901]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=21a01fc3-4875-4733-936d-db904ada4eda]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=28d49f25-f393-4c9e-8216-b76a0e300703]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=9f073881-6e9f-49c0-9faf-fe340571340e]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a4bff5cc-a69b-4e25-a734-b7c6d5cada77]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=41b176e2-f58a-4905-9aa2-8b03d27a7bdc]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=978265c6-0494-47e3-843c-8650137a6506]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5464af2a-dee3-41a6-816d-021bf5947753]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=20bf01fa-c41e-4184-aa98-ad4d34ffb1a6]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=47adddae-1f15-494f-a779-2aa73d2fa5e1]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c3f08da7-36c2-4514-b0d9-624cc4ba7e65]
module.keycloak_test.module.onestopauth_business.module.client_hets.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a784fbba-d62c-4d46-922d-6ed7e7a46f5f]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f328183e-4f9d-4dd0-a564-d3bb02f6503c]
module.keycloak_test.module.onestopauth_both.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e23c0698-fa49-4129-b20c-57e7340559e4]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c3087b26-aa89-4d28-8bce-a632cdedc27e]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=79cb4b72-2236-4264-8f5d-9a4f816ecf0e]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f27e646b-3323-4b73-96ac-e2b4dd67c598]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=1728e3b2-1418-45c0-90e1-363450bca67c]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=febf5192-04c7-485a-ba5a-ade68e04c086]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=384aeed6-eaf7-499e-abd5-78b9097e4dda]
module.keycloak_test.module.onestopauth_business.module.client_awp-2146.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=9448e748-e1ba-4feb-bed2-b47497c0a656]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=93076629-b365-4fbb-876e-d2486b4d2b58]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=aa54bd66-7db0-4edf-aef5-d59c1be7c01a]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d956fb54-754c-42fa-b973-b26a02d4e729]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=bfd21928-ceff-4d60-9ed6-9dc7ef047bfd]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=760c4ebe-5e17-4de5-befc-dc47866f4616]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=6ab9385f-a168-44bc-91ce-e87b1752d677]
module.keycloak_test.module.onestopauth_business.module.client_roadsafety-digital-forms.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ea7a1e16-fccc-451c-a4bc-22a73ecbf46b]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=bc415c7a-fce1-4ce5-9916-8b28879ca671]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=35376788-309c-415e-af27-201f411c880f]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5dcccb6-11fc-4959-891f-eb913d465e90]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=02a3db30-2c0e-45e1-965e-bd2f527c30d2]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8243acb3-99ef-4c49-a4dd-31ca6ff8ea46]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d1ab7822-ae59-4b13-bec4-b507bd5dd51a]
module.keycloak_test.module.onestopauth_business.module.client_test-client.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=28494fbf-480a-4bbf-bc13-576e074c197d]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ef90cbc1-79f8-41ff-bfd8-7674b88d9bfa]
module.keycloak_test.module.onestopauth_business.module.client_invasives-bc-1849.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fd9b0980-486b-471d-9e17-f662a8b76d24]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=4c7f560b-d0b7-4451-a70c-b0cff899b3dd]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=972b7c2f-0c1f-4623-92de-da5f4720dd1f]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=edc0aa1e-ba42-4b33-9aa0-bcc3c853b22d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=da101df4-6f77-4730-9aae-e031254c68c6]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=fa46fbc7-df18-4d40-bac8-f90276d596f9]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=98e2c03c-c4b2-4247-afcb-2f7c4587a19e]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2cc06bf6-6ce0-403a-a596-f2d85cd3e64d]
module.keycloak_dev.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=11463c0e-ffcb-4620-90d5-d3bc3453b6b3]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=fe253f42-fa4c-4de5-931c-5d2eb5a06072]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=94ff68ca-1fd6-446d-847b-7d6ad9392901]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c5e74057-c94f-4a30-b18c-84fb1d500477]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=ac4101b1-a5f1-4552-90df-639831c6d7d8]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ce54c332-46a6-4f14-9e3f-be5e5b933ff1]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=ee5f65ba-c02b-438b-9779-b790910e0db0]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d59efa72-b2de-4586-895e-aefce069184c]
module.keycloak_dev.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=5a60d017-1041-45de-857a-a86f27c37dea]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=8c1ef37a-f490-4930-9872-bdc679b86d41]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=8fae1957-fc42-4d0a-a16d-f80967e5be74]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=61ba36cc-85c4-4a29-9ec6-24d8f084a2ef]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=328730fd-9df2-406d-b43d-0e5b450c6ed0]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=c4158cca-c5a0-4a5c-9339-1fa87acfdd5c]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=03d53390-0147-47ad-875a-a9f0927b9bfc]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3da90b88-8373-4935-821f-105dd858915c]
module.keycloak_dev.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a3652228-cde4-4b18-94c8-7ad95dd2c75e]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=b7ce6f0e-e17e-4773-b298-cdab9e403260]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=138b27cc-20ca-4387-b3c8-e3678d6b7578]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1f52e6d5-7573-424a-badb-919f8b37b1a1]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=de6759e3-f34a-44f2-80bf-70f389217fee]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8ed88e91-2fa6-4caa-9866-1b7e841c1d2d]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=b9a9c25c-7581-4814-9386-50f8a95d78e4]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=791fb085-4077-4292-8bd6-089822864060]
module.keycloak_test.module.onestopauth.module.client_front-counter-bc-fider-661.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=013df6be-f41a-4cd5-b20a-c4bd294472a0]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d7e50097-5bff-4e3e-b239-f1145d6e5753]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b39ea164-2a54-487a-9e70-e24bb8725b05]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=77ecb837-262f-4c95-928a-02747857d333]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa5ba504-05e2-4b35-bbdc-f42a96826811]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0b955a72-4cb1-4e12-b22b-d4e669dd18b9]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=32e4d193-e002-466b-9494-9fc499be1ddd]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=036873cc-1079-4bcc-8d80-28fa3eae032e]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=47288847-b2d5-4398-8491-7e80aa875e90]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=0dd0e9a1-17a5-4289-9e6b-b7bcf38a831e]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ccee6b0d-a27d-45c7-afad-c4dfd345e614]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=7a3a2d15-6cd7-44a2-a64b-ce27dc1da650]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5d5f9440-3e5f-49b8-a1bb-8a5229dccc16]
module.keycloak_test.module.onestopauth.module.client_csb-secure-file-transfer-232.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=0e689aa1-a2ce-4c30-b366-7e79238036a3]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=24194681-e44b-4bb4-890e-f52025105f67]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6bd54c02-2628-489d-aa5c-3d027abb45da]
module.keycloak_test.module.onestopauth.module.client_work-bc-teacher-resources.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6486ccdb-4981-4c76-9829-51888ac63f6a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "itvr-2674"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "itvr-2674"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_itvr-2674.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "itvr-2674"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "itvr-2674"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://itvr-dev.apps.silver.devops.gov.bc.ca/",
        ]
      + web_origins                              = [
          + "+",
          + "https://itvr-dev.apps.silver.devops.gov.bc.ca/",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "itvr-2674"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "itvr-2674"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_itvr-2674.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "itvr-2674"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "itvr-2674"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://itvr-test.apps.silver.devops.gov.bc.ca/",
        ]
      + web_origins                              = [
          + "+",
          + "https://itvr-test.apps.silver.devops.gov.bc.ca/",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 761 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*